# FailedToTransformAttachedGroup Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..FailedToTransformAttachedGroup Property
BuiltInFailures..::..GroupFailures Class See Also
---
Attached group could not be properly relocated.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FailedToTransformAttachedGroup { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FailedToTransformAttachedGroup As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FailedToTransformAttachedGroup {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace